Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: :term:`WKS_FILE`: The location of the :ref:`Wic kickstart <ref-manual/kickstart:openembedded kickstart (\`\`.wks\`\`) reference>` file used by the OpenEmbedded build system to create a partitioned image.
it_it: :term:`WKS_FILE`: Il path del file :ref:`Wic kickstart <ref-manual/kickstart:openembedded kickstart (\`\`.wks\`\`) reference>` utilizzato dal sistema di build OpenEmbedded per creare un'immagine partizionata.

source: :term:`WORKDIR`: The location where the OpenEmbedded build system builds a recipe (i.e. does the work to create the package).
it_it: :term:`WORKDIR`: La directory in cui il sistema di build OpenEmbedded crea una ricetta (ovvero, esegue le operazioni necessarie per creare il pacchetto).

source: :term:`bitbake:BB_HASHSERVE`, specifying a local or remote Hash Equivalence server to use.
it_it: :term:`bitbake:BB_HASHSERVE`, che specifica un server di equivalenza dell'hash locale o remoto da utilizzare.

source: :term:`bitbake:BB_SIGNATURE_HANDLER`, which must be set to ``OEEquivHash``.
it_it: :term:`bitbake:BB_SIGNATURE_HANDLER`, che deve essere impostato su ``OEEquivHash``.

source: :yocto_git:`Source Repositories: <>` This area contains :term:`BitBake`, :term:`OpenEmbedded-Core (OE-Core)`, Yocto documentation and other metadata layers. You can create local copies of Git repositories for each of these areas.
it_it: :yocto_git:`Source Repositories: <>` Quest'area contiene :term:`BitBake`, :term:`OpenEmbedded-Core (OE-Core)`, documentazione Yocto e altri layer di metadati. È possibile creare copie locali dei repository Git per ciascuna di queste aree.

source: :yocto_home:`Releases page </development/releases/>`: The :yocto_home:`Yocto Project website <>` includes a "Releases" page accessible through the "Development" menu that allows you to download any Yocto Project release, tool, and Board Support Package (BSP) in tarball form. The hyperlinks point to the tarballs under :yocto_dl:`/releases/yocto/`.
it_it: :yocto_home:`Pagina delle Release </development/releases/>`: Il :yocto_home:`sito web di Yocto Project <>` include una pagina "Releases" accessibile tramite il menù "Development" che consente di scaricare qualsiasi release, tool e Board Support Package (BSP) di Yocto Project in formato tarball. I link ipertestuali puntano ai file tarball nella directory :yocto_dl:`/releases/yocto/`.

source: A "trivial" change to a recipe that doesn't impact its generated output, such as whitespace changes, modifications to unused code paths or in the ordering of variables.
it_it: Una modifica "banale" a una ricetta che non influisce sull'output generato, come ad esempio modifiche agli spazi bianchi, ai path di codice non utilizzati o all'ordine delle variabili.

source: A *native sysroot* contains all the **host** files and executables needed to build the recipe.
it_it: Un *sysroot nativo* contenente tutti i file e gli eseguibili **host** necessari per compilare la ricetta.

source: A *target sysroot* contains all the **target** libraries and headers needed to build the recipe.
it_it: Un *sysroot target* contenente tutte le librerie e gli header **target** necessari per compilare la ricetta.

source: A :term:`Configuration Fragment` (also called Standard :term:`Configuration Fragment`) is a :term:`configuration file` that contains configuration statements such as variable assignments, affecting the build at a global-level when the fragment is enabled. By default, configuration fragments are located in the :file:`conf/fragments/` directory of a :term:`Layer`.
it_it: Un :term:`Configuration Fragment` (chiamato anche :term:`Configuration Fragment` Standard) è un :term:`configuration file` che contiene istruzioni di configurazione, come ad esempio le assegnazioni di variabili, che influenzano la build a livello globale quando il frammento è abilitato. Per default, i frammenti di configurazione si trovano nella directory :file:`conf/fragments/` di un :term:`Layer`.

source: A :term:`Mixin` layer is a layer which can be created by the community to add a specific feature or support a new version of some package for an :term:`LTS` release. See the :ref:`ref-long-term-support-releases` section for details.
it_it: Un layer :term:`Mixin` è un layer che può essere creato dalla community per aggiungere una funzionalità specifica o supportare una nuova versione di un pacchetto per una release :term:`LTS`. Per maggiori dettagli, consultare la sezione :ref:`ref-long-term-support-releases`.

source: A :term:`SPDX` defined standard for expressing how one or more licenses apply to a work.
it_it: Uno standard definito da :term:`SPDX` per esprimere come una o più licenze si applicano a un'opera.

source: A BSP consists of a file structure inside a base directory. Collectively, you can think of the base directory, its file structure, and the contents as a BSP layer. Although not a strict requirement, BSP layers in the Yocto Project use the following well-established naming convention::
it_it: Un BSP è costituito da una struttura di file all'interno di una directory di base. Nel loro insieme, la directory base, la sua struttura di file e il suo contenuto possono essere considerati come un layer BSP. Sebbene non sia un requisito rigoroso, i layer BSP in Yocto Project utilizzano la seguente convenzione di denominazione consolidata::

source: A BSP layer provides machine configurations that target specific hardware. Everything in this layer is specific to the machine for which you are building the image or the SDK. A common structure or form is defined for BSP layers. You can learn more about this structure in the :doc:`/bsp-manual/index`.
it_it: Un layer BSP fornisce configurazioni macchina destinate a hardware specifici. Tutto ciò che si trova in questo layer è specifico per la macchina per la quale si sta creando l'immagine o l'SDK. Per i layer BSP è definita una struttura o un formato comune. È possibile trovare maggiori informazioni su questa struttura nel manuale :doc:`/bsp-manual/index`.

source: A BSP layer's configuration directory contains configuration files for the machine (``conf/machine/machine.conf``) and, of course, the layer (``conf/layer.conf``).
it_it: La directory di configurazione di un layer BSP contiene i file di configurazione per la macchina (``conf/machine/machine.conf``) e, naturalmente, per il layer stesso (``conf/layer.conf``).

source: A Board Support Package (BSP) is a collection of information that defines how to support a particular hardware device, set of devices, or hardware platform. The BSP includes information about the hardware features present on the device, any essential bootloader, kernel and device tree configuration, along with any additional hardware drivers required. The BSP also lists any additional software components required in addition to a generic Linux software stack for both essential and optional platform features.
it_it: Un Board Support Package (BSP) è una raccolta di informazioni che definisce come supportare un particolare dispositivo hardware, un insieme di dispositivi o una piattaforma hardware. Il BSP include informazioni sulle funzionalità hardware presenti sul dispositivo, su eventuali bootloader essenziali, sulla configurazione del kernel e del device tree, nonché su tutti i driver hardware aggiuntivi necessari. Il BSP elenca anche tutti i componenti software aggiuntivi richiesti, oltre a uno stack software Linux generico per le funzionalità essenziali e opzionali della piattaforma.

source: A Git repository represents all development efforts for a given project. For example, the Git repository :yocto_git:`yocto-docs </yocto-docs>` contains all changes and developments for that repository over the course of its entire life. That means that all changes that make up all releases are captured. The repository maintains a complete history of changes.
it_it: Un repository Git rappresenta tutte le attività di sviluppo relative a un determinato progetto. Ad esempio, il repository Git :yocto_git:`yocto-docs </yocto-docs>` contiene tutte le modifiche e gli sviluppi relativi a quel repository nel corso della sua intera esistenza. Ciò significa che tutte le modifiche che compongono tutte le release vengono registrate. Il repository mantiene una cronologia completa delle modifiche.

source: A ``config`` directory, representing the current configuration used for this :term:`bitbake:setup`.
it_it: È presente anche una directory ``config``, che rappresenta la configurazione corrente utilizzata per questo :term:`bitbake:setup`.

source: A base-level functional distro (:term:`DISTRO`) used to illustrate how to customize a distribution.
it_it: Una distribuzione funzionale di base (:term:`DISTRO`) utilizzata per illustrare come personalizzare una distribuzione.

source: A base-level functional distro used to illustrate how to customize a distribution.
it_it: Una distribuzione funzionale di base utilizzata per illustrare come personalizzare una distribuzione.

source: A benchmark example of an open source project is the Linux kernel, which was initially conceived and created by Finnish computer science student Linus Torvalds in 1991. Conversely, a good example of a non-open source project is the Windows family of operating systems developed by Microsoft Corporation.
it_it: Un esempio emblematico di progetto open source è il kernel Linux, inizialmente concepito e creato dallo studente finlandese di informatica Linus Torvalds nel 1991. Al contrario, un buon esempio di progetto non open source è la famiglia di sistemi operativi Windows sviluppata da Microsoft Corporation.

source: A brief description of the target hardware.
it_it: Breve descrizione dell'hardware target.

source: A built-in fragment is a specific kind of :term:`Configuration Fragment` that affects the value of a single variable globally. :term:`Built-in Fragments <Built-in Fragment>` do not require a separate configuration file, but like a standard :term:`Configuration Fragment`, Built-in Fragments can be enabled or disabled using the :oe_git:`bitbake-config-build </bitbake/tree/bin/bitbake-config-build>` command-line utility.
it_it: Un built-in fragment [frammento nativo] è un tipo specifico di :term:`Configuration Fragment` che influenza il valore di una singola variabile a livello globale. I :term:`Built-in Fragments <Built-in Fragment>` non richiedono un file di configurazione separato, ma, come un normale :term:`Configuration Fragment`, possono essere abilitati o disabilitati tramite l'utilità da riga di comando :oe_git:`bitbake-config-build </bitbake/tree/bin/bitbake-config-build>`.

source: A collection of manuals covering many aspects of the Yocto Project, including reference definitions, tutorials, and details about the project's infrastructure.
it_it: Una raccolta di manuali che coprono molti aspetti di Yocto Project, incluse definizioni di riferimento, tutorial e dettagli sull'infrastruttura del progetto.

source: A collection of related recipes. Layers allow you to consolidate related metadata to customize your build. Layers also isolate information used when building for multiple architectures. Layers are hierarchical in their ability to override previous specifications. You can include any number of available layers from the Yocto Project and customize the build by adding your layers after them. You can search the Layer Index for layers used within Yocto Project.
it_it: Una raccolta di ricette correlate. I layer consentono di consolidare i metadati correlati per personalizzare la build. I layer isolano inoltre le informazioni utilizzate durante la build per architetture multiple. I layer sono gerarchici nella loro capacità di sovrascrivere le specifiche precedenti. È possibile includere un numero qualsiasi di layer disponibili da Yocto Project e personalizzare la build aggiungendo i layer desiderati. È possibile cercare nel "Layer Index" i layer utilizzati all'interno di Yocto Project.

source: A couple of the more interesting call chains are expanded and displayed above, basically some network receive paths that presumably end up waking up wget (BusyBox) when network data is ready.
it_it: Un paio delle catene di chiamate più interessanti sono espanse e visualizzate sopra, in pratica alcuni percorsi di ricezione di rete che presumibilmente finiscono per risvegliare wget (BusyBox) quando i dati di rete sono pronti [ready].

source: A custom SDK for application developers. This eSDK allows developers to incorporate their library and programming changes back into the image to make their code available to other application developers.
it_it: Un SDK custom per gli sviluppatori di applicazioni. Questo eSDK consente agli sviluppatori di integrare le proprie librerie e modifiche di programmazione nell'immagine, rendendo il codice disponibile ad altri sviluppatori di applicazioni.

source: A development host or :term:`Build Host` is key to using the Yocto Project. Because the goal of the Yocto Project is to develop images or applications that run on embedded hardware, development of those images and applications generally takes place on a system not intended to run the software --- the development host.
it_it: Un host di sviluppo, o :term:`Build Host` è fondamentale per utilizzare Yocto Project. Poiché l'obiettivo di Yocto Project è sviluppare immagini o applicazioni che vengano eseguite su hardware embedded, lo sviluppo di tali immagini e applicazioni avviene generalmente su un sistema non destinato all'esecuzione del software, ovvero l'host di sviluppo.

source: A distribution layer provides policy configurations for your distribution. Best practices dictate that you isolate these types of configurations into their own layer. Settings you provide in ``conf/distro/distro.conf`` override similar settings that BitBake finds in your :ref:`structure-build-conf-local.conf` file in the :term:`Build Directory`.
it_it: Un layer di distribuzione fornisce le configurazioni delle policy per la distribuzione. Le best practice suggeriscono di isolare questo tipo di configurazioni in un layer dedicato. Le impostazioni che si forniscono in ``conf/distro/distro.conf`` sovrascrivono le impostazioni simili che BitBake trova nel file :ref:`structure-build-conf-local.conf` nella directory :term:`Build Directory`.

source: A fragment :term:`configuration file` must contain a summary (:term:`BB_CONF_FRAGMENT_SUMMARY`) and a description (:term:`BB_CONF_FRAGMENT_DESCRIPTION`) explaining the purpose of the fragment.
it_it: Um frammento di :term:`configuration file` deve contenere un riepilogo [summary] (:term:`BB_CONF_FRAGMENT_SUMMARY`) e una descrizione (:term:`BB_CONF_FRAGMENT_DESCRIPTION`) che ne spieghino lo scopo.

source: A future update can change the value to ``Backport`` or ``Denied`` as appropriate.
it_it: Un futuro aggiornamento potrebbe modificare il valore in ``Backport`` o ``Denied`` a seconda dei casi.

source: A generic ARM 64 platform (``genericarm64``)
it_it: Una piattaforma ARM 64 generica (``genericarm64``)

source: A given file can only ever be in one package. By iterating from the leftmost to rightmost package in :term:`PACKAGES`, each file matching one of the patterns defined in the corresponding :term:`FILES` definition is included in the package.
it_it: Un dato file può appartenere a un solo pacchetto. Iterando dal pacchetto più a sinistra a quello più a destra in :term:`PACKAGES`, ogni file che corrisponde a uno dei modelli definiti nella corrispondente definizione di :term:`FILES` viene incluso nel pacchetto.

source: A goal of the Yocto Project is to lead the open source industry with a project that automates testing and QA procedures. In doing so, the project encourages a development community that publishes QA and test plans, publicly demonstrates QA and test plans, and encourages development of tools that automate and test and QA procedures for the benefit of the development community.
it_it: Uno degli obiettivi di Yocto Project è quello di essere leader nel settore open source con un progetto che automatizza le procedure di test e QA. In tal modo, il progetto incoraggia una comunità di sviluppatori che pubblica piani di QA e di test, li dimostra pubblicamente e promuove lo sviluppo di strumenti che automatizzano le procedure di test e QA a beneficio dell'intera comunità.

source: A good practice is to include the CVE identifier in the patch file name, the patch file commit message and optionally in the recipe commit message.
it_it: Una buona pratica consiste nell'includere l'identificativo CVE nel nome del file patch, nel messaggio di commit del file patch e, facoltativamente, nel messaggio di commit della ricetta.

source: A group of drivers, definitions, and other components that provide support for a specific hardware configuration. For more information on BSPs, see the :doc:`/bsp-manual/index`.
it_it: Un gruppo di driver, definizioni e altri componenti che forniscono supporto per una specifica configurazione hardware. Per ulteriori informazioni sui BSP, consultare il :doc:`/bsp-manual/index`.

source: A key element of the Yocto Project is the Metadata that is used to construct a Linux distribution and is contained in the files that the :term:`OpenEmbedded Build System` parses when building an image. In general, Metadata includes recipes, configuration files, and other information that refers to the build instructions themselves, as well as the data used to control what things get built and the effects of the build. Metadata also includes commands and data used to indicate what versions of software are used, from where they are obtained, and changes or additions to the software itself (patches or auxiliary files) that are used to fix bugs or customize the software for use in a particular situation. OpenEmbedded-Core is an important set of validated metadata.
it_it: Un elemento chiave di Yocto Project sono i metadati utilizzati per costruire una distribuzione Linux, contenuti nei file che l':term:`OpenEmbedded Build System` analizza durante la creazione di un'immagine. In generale, i Metadati includono ricette, file di configurazione e altre informazioni relative alle istruzioni di compilazione [build], nonché i dati utilizzati per controllare cosa viene compilato e gli effetti della compilazione. I Metadati includono anche comandi e dati che indicano le versioni del software utilizzate, la loro provenienza e le modifiche o aggiunte al software stesso (patch o file ausiliari) utilizzate per correggere bug o personalizzare il software per un utilizzo specifico. OpenEmbedded-Core è un importante insieme di metadati validati.

source: A layer index is a web application that contains information about a set of custom layers. A good example of an existing layer index is the OpenEmbedded Layer Index. A public instance of this layer index exists at :oe_layerindex:`/`. You can find the code for this layer index's web application at :yocto_git:`/layerindex-web/`.
it_it: Un indice di layer è un'applicazione web che contiene informazioni su un insieme di layer personalizzati. Un buon esempio di indice di layer esistente è l'OpenEmbedded Layer Index. Un'istanza pubblica di questo indice di layer è disponibile all'indirizzo :oe_layerindex:`/`. Il codice sorgente dell'applicazione web di questo indice di layer è disponibile all'indirizzo :yocto_git:`/layerindex-web/`.

source: A list of all the dependencies of the BSP. These dependencies are typically a list of required layers needed to build the BSP. However, the dependencies should also contain information regarding any other dependencies the BSP might have.
it_it: Elenco di tutte le dipendenze del BSP. Queste dipendenze sono in genere un elenco dei layer necessari per la compilazione del BSP. Tuttavia, l'elenco dovrebbe includere anche informazioni relative a qualsiasi altra dipendenza del BSP.

source: A means by which to test the Yocto Project components (i.e. Poky is used to validate the Yocto Project).
it_it: Un mezzo per testare i componenti di Yocto Project (ovvero, Poky viene utilizzato per validare Yocto Project).

source: A new :term:`LTS` release is made every two years and is supported for four years. This offers more stability to project users and leaves more time to upgrade to the following :term:`LTS` release.
it_it: Una nuova versione :term:`LTS` viene rilasciata ogni due anni ed è supportata per quattro anni. Questo offre maggiore stabilità agli utenti del progetto e lascia più tempo per l'aggiornamento alla successiva versione :term:`LTS`.

source: A new ``.sig`` file was created: this means the artifact was successfully signed, and the signature is stored in a separate ``.sig`` file.
it_it: È stato creato un nuovo file ``.sig``: questo significa che l'artefatto è stato firmato correttamente e la firma è memorizzata in un file ``.sig`` separato.

source: A nice series of articles on using ftrace and trace-cmd are available at LWN:
it_it: Una serie di articoli sull'utilizzo di ftrace e trace-cmd è disponibile su LWN:

source: A per-recipe unit of execution for BitBake (e.g. :ref:`ref-tasks-compile`, :ref:`ref-tasks-fetch`, :ref:`ref-tasks-patch`, and so forth). One of the major benefits of the build system is that, since each recipe will typically spawn the execution of numerous tasks, it is entirely possible that many tasks can execute in parallel, either tasks from separate recipes or independent tasks within the same recipe, potentially up to the parallelism of your build system.
it_it: Un'unità di esecuzione per ricetta per BitBake (ad esempio :ref:`ref-tasks-compile`, :ref:`ref-tasks-fetch`, :ref:`ref-tasks-patch` e così via). Uno dei principali vantaggi del sistema di compilazione è che, poiché ogni ricetta in genere avvia l'esecuzione di numerosi task [attività], è del tutto possibile che molti task vengano eseguiti in parallelo, sia i task provenienti da ricette separate, quelli indipendenti all'interno della stessa ricetta, potenzialmente fino al livello di parallelismo del sistema di compilazione.

source: A recipe may have :term:`UPSTREAM_STABLE_RELEASE_REGEX` set based on the following criteria:
it_it: Una ricetta può avere :term:`UPSTREAM_STABLE_RELEASE_REGEX` impostato in base ai seguenti criteri:

source: A reference to source code or repositories that are not local to the development system but located in a remote area that is controlled by the maintainer of the source code. For example, in order for a developer to work on a particular piece of code, they need to first get a copy of it from an "upstream" source.
it_it: Riferimento al codice sorgente o ai repository che non si trovano localmente sul sistema di sviluppo, ma in un'area remota controllata dal manutentore del codice sorgente. Ad esempio, affinché uno sviluppatore possa lavorare su una specifica porzione di codice, deve prima ottenerne una copia da una sorgente "upstream".

source: A relocatable toolchain used outside of BitBake by developers when developing applications that will run on a targeted device.
it_it: Una toolchain riallocabile utilizzata dagli sviluppatori al di fuori di BitBake durante lo sviluppo di applicazioni destinate a un dispositivo specifico.

source: A set of :term:`buildtools` binaries extended with additional development tools, such as a required version of the GCC compiler to run the OpenEmbedded build system.
it_it: Un set di binari :term:`buildtools` esteso con strumenti di sviluppo aggiuntivi, come una versione necessaria del compilatore GCC per eseguire il sistema di build di OpenEmbedded.
